app/views/users/edit.html.haml

    let csrf = e.target.authenticity_token.value;
    let login = e.target.user[login].value;
---
SELECT "users".* FROM "users" WHERE "users"."id" = $1 ORDER BY position ASC LIMIT $2  [["id", 1], ["LIMIT", 1]]