app/controllers/application_controller.rb

SELECT "users".* FROM "users" WHERE "users"."id" = $1 ORDER BY position ASC LIMIT $2  [["id", 1], ["LIMIT", 1]]
---
  def current_user
    return unless session[:user_id]
    #@current_user ||= User.find(session[:user_id])
    #puts session[:session_id]
    @current_user ||= session[:user_id] && User.find_by(id: session[:user_id])