app/controllers/dashboard_controller.rb

  def show
    @tags = User.tag_counts_on(:tags)
    @user = current_user
    @post = Post.new
    @posts = @user.posts.find(:all).paginate(:page => params[:page], :per_page => 5)
---
SELECT "posts".* FROM "posts" WHERE "posts"."user_id" = $1 ORDER BY created_at DESC LIMIT $2 OFFSET $3  [["user_id", 1], ["LIMIT", 5], ["OFFSET", 0]]
SELECT COUNT(*) FROM "posts" WHERE "posts"."user_id" = $1  [["user_id", 1]]

  def create_photo
    @user = current_user

     if @user.update_attributes(params[:user])
---
UPDATE "users" SET "updated_at" = $1, "photo_file_name" = $2, "photo_content_type" = $3, "photo_file_size" = $4, "photo_updated_at" = $5 WHERE "users"."id" = $6

  def destroy_photo
    @user = current_user.photo.destroy

    current_user.update_attribute(:photo_file_name, nil)
---
UPDATE "users" SET "updated_at" = $1, "photo_file_name" = $2, "photo_content_type" = $3, "photo_file_size" = $4, "photo_updated_at" = $5 WHERE "users"."id" = $6  [["updated_at", "2024-02-12 04:11:15.867797"], ["photo_file_name", nil], ["photo_content_type", nil], ["photo_file_size", nil], ["photo_updated_at", nil], ["id", 1]]

  def destroy_demo
    @user = current_user.demo.destroy

    current_user.update_attribute(:demo_file_name, nil)
    current_user.update_attribute(:demo_content_type, nil)
    current_user.update_attribute(:demo_file_size, "")
    current_user.update_attribute(:demo_updated_at, "")
---
UPDATE "users" SET "updated_at" = $1, "photo_file_name" = $2, "photo_content_type" = $3, "photo_file_size" = $4, "photo_updated_at" = $5 WHERE "users"."id" = $6  [["updated_at", "2024-02-12 04:11:15.867797"], ["photo_file_name", nil], ["photo_content_type", nil], ["photo_file_size", nil], ["photo_updated_at", nil], ["id", 1]]