app/controllers/folios_controller.rb

SELECT "folios".* FROM "folios" WHERE "folios"."id" = $1 ORDER BY created_at DESC LIMIT $2  [["id", 1], ["LIMIT", 1]]
SELECT "folios".* FROM "folios" ORDER BY position asc LIMIT $1 OFFSET $2  [["LIMIT", 18], ["OFFSET", 0]]
---
  def index
    @folio1 = Folio.find_by(id: 1)
    #puts @folio1.description
    @folio = Folio.all.reorder('position asc').paginate(:page => params[:page], :per_page => 18) #find(:all).paginate(:page => params[:page], :per_page => 18)