app/controllers/posts_controller.rb

SELECT "posts".* FROM "posts" WHERE "posts"."tag_type" = $1 ORDER BY created_at DESC LIMIT $2 OFFSET $3  [["tag_type", "Visible"], ["LIMIT", 5], ["OFFSET", 0]]
---
  def state
    @posts = Post.where(tag_type: "Visible").paginate(page: params[:page], per_page: 5)

SELECT "posts".* FROM "posts" WHERE "posts"."tag_type" = $1 ORDER BY created_at DESC LIMIT $2 OFFSET $3  [["tag_type", "Visible"], ["LIMIT", 5], ["OFFSET", 0]]
---
  def visiblefr
    @posts = Post.where(tag_type: "Visible").paginate(page: params[:page], per_page: 5)#.order(created_at: :desc)

INSERT INTO "posts" ("user_id", "tag_type", "url", "photo", "title", "body", "model", "created_at", "updated_at", "recorded_url") VALUES ($1, $2, $3, $4, $5, $6, $7, $8, $9, $10) RETURNING "id"
---
  def create
    post_type = params[:post][:model].tableize
    #@post = current_user.send(post_type).build(params[:post])

    @post = Post.new(post_params)#(params[:post])
    @post.user_id = current_user.id
    #@post.model = post_type
    @post.recorded_url = @post.fetch_oembed_data(params[:post][:url]) if post_type == "videos"

    if @post.save

SELECT "posts".* FROM "posts" WHERE "posts"."id" = $1 ORDER BY created_at DESC LIMIT $2  [["id", 1], ["LIMIT", 1]]
---
  def edit
    @post = Post.find(params[:id])

SELECT "posts".* FROM "posts" WHERE "posts"."id" = $1 ORDER BY created_at DESC LIMIT $2  [["id", 1], ["LIMIT", 1]]
UPDATE "posts" SET "tag_type" = $1, "body" = $2, "model" = $3, "updated_at" = $4 WHERE "posts"."id" = $5
---
  def update
    @post = Post.find_by_id(params[:id])
    params[:post][:recorded_url] = @post.fetch_oembed_data(params[:post][:url]) if params[:post][:model].tableize == "videos"
    if @post.update(post_params)#(params[:post])