app/controllers/user_sessions_controller.rb

  def create
      #@user_session = UserSession.new(params[:user_session])
      #@user_session = UserSession.new(user_session_params.to_h)
      @user_session = User.find_by(login: params[:user_session][:login])
---
SELECT "users".* FROM "users" WHERE "users"."login" = $1 ORDER BY position ASC LIMIT $2  [["login", "admin"], ["LIMIT", 1]]