app/controllers/users_controller.rb

  def index
    @user = User.all
    @users = @user.paginate(:page => params[:page], :per_page => 15)
---
SELECT "users".* FROM "users" ORDER BY position ASC LIMIT $1 OFFSET $2  [["LIMIT", 15], ["OFFSET", 0]]

  def update
    @user = current_user #User.find(params[:id])
    respond_to do |format|
      if @user.update_attributes(params[:user])
---
UPDATE "users" SET "phone" = $1, "location" = $2, "dob" = $3, "tag_type" = $4, "updated_at" = $5 WHERE "users"."id" = $6  [["phone", ""], ["location", ""], ["dob", "1924-03-03"], ["tag_type", "Developer"], ["updated_at", "2024-03-03 19:42:24.874005"], ["id", 1]]

  def prioritize_tasks
    users = User.find(:all)
---
SELECT "users".* FROM "users" WHERE "users"."id" = $1 ORDER BY position ASC LIMIT $2  [["id", 1], ["LIMIT", 1]]